Renova/src/Documents/АктНРП/АктНРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктНРП</name>
  <registerRecords>AccumulationRegister.АктыКонтрагентДатаСроки</registerRecords>
  <registerRecords>AccumulationRegister.АктыПродукцияИКод</registerRecords>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПродавца</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлиента</name>
    <type>
      <types>EnumRef.ВидКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаметкаДляПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>EnumRef.ВидМестонахожденияНРП</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРабот</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Renova/src/AccumulationRegisters/АктыКонтрагентДатаСроки/АктыКонтрагентДатаСроки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктыКонтрагентДатаСроки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокВЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/АктыПродукцияИКод/АктыПродукцияИКод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктыПродукцияИКод</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Documents/АктНРП/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистры       
	Движения.АктыКонтрагентДатаСроки.Очистить();
	Движения.АктыКонтрагентДатаСроки.Записать();
	Движения.АктыПродукцияИКод.Очистить(); 
	Движения.АктыПродукцияИКод.Записать();
	
	Движения.АктыПродукцияИКод.Записывать = Истина;
	Движения.АктыКонтрагентДатаСроки.Записывать = Истина; 	
	// регистр АктыПродукцияИКод          
	
	ДвижениеАктыПродукцияИКод = Движения.АктыПродукцияИКод.Добавить();
	ДвижениеАктыПродукцияИКод.Период = Дата;
	ДвижениеАктыПродукцияИКод.ВидПродукции = ВидПродукции;
	ДвижениеАктыПродукцияИКод.МодельПродукции = МодельПродукции;
	ДвижениеАктыПродукцияИКод.КодНеисправности = КодНеисправности;
	ДвижениеАктыПродукцияИКод.Количество = 1;
	
	// регистр АктыКонтрагентДатаСроки
	
	ДвижениеАктыКонтрагентДатаСроки = Движения.АктыКонтрагентДатаСроки.Добавить();
	ДвижениеАктыКонтрагентДатаСроки.Период = Дата;
	ДвижениеАктыКонтрагентДатаСроки.СервисныйЦентр = СервисныйЦентр;
	ДвижениеАктыКонтрагентДатаСроки.ДатаПокупки = ДатаПокупки;
	ДвижениеАктыКонтрагентДатаСроки.Количество = 1;
	Если Не ЗначениеЗаполнено(ДатаПокупки) Тогда
		СрокВДнях = 0;
	Иначе
		Если  ЗначениеЗаполнено(ДатаПокупки) Тогда
			СрокВДнях = (НачалоДня(Дата)- НачалоДня(ДатаПокупки))/8400;  
		КонецЕсли;
		ДвижениеАктыКонтрагентДатаСроки.СрокВЭксплуатации = СрокВДнях;
	КонецЕсли;
	
	
КонецПроцедуры
	
#КонецОбласти
